Revit 2016 API
LoadCase.NatureCategory Property
 The nature category of the load case.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public LoadNatureCategory NatureCategory { get; set; }
Visual Basic
Public Property NatureCategory As LoadNatureCategory
	Get
	Set
Visual C++
public:
property LoadNatureCategory NatureCategory {
	LoadNatureCategory get ();
	void set (LoadNatureCategory value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace